uyencorki/uvc-ai-stm32/Src/app.c
  for (i = 0; i < 16; i++)
  {
    g_pipe1_first16_snapshot[i] = src[i];
  }

  for (i = 0; i < 64; i++)
  {
    g_pipe1_first64_snapshot[i] = src[i];
  }

  g_pipe1_first16_snapshot_ready = 1;
}

static void app_capture_pipe1_snapshot_if_pending(void)
{
  int idx;

  if (g_pipe1_first16_snapshot_ready != 0)
  {
    g_pipe1_snapshot_pending = 0;
    return;
  }

  if (g_pipe1_snapshot_pending == 0)
  {
    return;
  }

  idx = g_pipe1_snapshot_idx;
  g_pipe1_snapshot_pending = 0;

  if ((idx < 0) || (idx >= CAPTURE_BUFFER_NB))
  {
    return;
  }

  app_capture_pipe1_snapshot_once(capture_buffer[idx]);
}

static void app_dump_pipe1_first_bytes_once(void)
{
  uint8_t *buf;
  uint32_t sum16;
  uint32_t sum64;
  uint32_t frame_pitch;
  uint32_t frame_bytes;
  int i;

  if ((g_pipe1_first_dump_done != 0) || (g_pipe1_first16_snapshot_ready == 0))
  {
    return;
  }

  buf = g_pipe1_first16_snapshot;
  sum16 = 0U;
  for (i = 0; i < 16; i++)
  {
    sum16 += buf[i];
  }

    sum64 = 0U;
    for (i = 0; i < 64; i++)
    {
      sum64 += g_pipe1_first64_snapshot[i];
    }

    frame_pitch = (uint32_t)VENC_WIDTH * (uint32_t)CAPTURE_BPP;
    frame_bytes = (uint32_t)VENC_WIDTH * (uint32_t)VENC_HEIGHT * (uint32_t)CAPTURE_BPP;

    printf("[CAM][FRAME] pipe1 out=%dx%d bpp=%d pitch=%lu bytes=%lu fmt=%d\r\n",
      VENC_WIDTH,
      VENC_HEIGHT,
      CAPTURE_BPP,
      (unsigned long)frame_pitch,
      (unsigned long)frame_bytes,
      CAPTURE_FORMAT);

  printf("[CAM][DATA] PIPE1 first 10 bytes: %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X\r\n",
         buf[0], buf[1], buf[2], buf[3], buf[4], buf[5], buf[6], buf[7], buf[8], buf[9]);
    printf("[CAM][DATA] PIPE1 first16_sum=%lu first64_sum=%lu addr=0x%08lX bpp=%d\r\n",
         (unsigned long)sum16,
      (unsigned long)sum64,
         (unsigned long)buf,
         CAPTURE_BPP);

  g_pipe1_first_dump_done = 1;
}

static void app_log_cam_health_1s(void)
{
  uint32_t now_ms = HAL_GetTick();

  if ((now_ms - g_cam_health_last_ms) < 1000U)
  {
    return;
  }

    printf("[CAM][HEALTH] 1s p1_frame=+%lu p2_frame=+%lu p1_vsync=+%lu rearm_ok=%lu rearm_fail=%lu err0=+%lu err1=+%lu err2=+%lu tot_err=(%lu,%lu,%lu)\r\n",
         (unsigned long)(g_pipe1_frame_irq_count - g_cam_health_last_pipe1_frame),
         (unsigned long)(g_pipe2_frame_irq_count - g_cam_health_last_pipe2_frame),
         (unsigned long)(g_pipe1_vsync_irq_count - g_cam_health_last_pipe1_vsync),
      (unsigned long)g_pipe1_rearm_ok_count,
      (unsigned long)g_pipe1_rearm_fail_count,
         (unsigned long)(g_pipe_error_irq_count[0] - g_cam_health_last_pipe_err[0]),
         (unsigned long)(g_pipe_error_irq_count[1] - g_cam_health_last_pipe_err[1]),
         (unsigned long)(g_pipe_error_irq_count[2] - g_cam_health_last_pipe_err[2]),
         (unsigned long)g_pipe_error_irq_count[0],
         (unsigned long)g_pipe_error_irq_count[1],
         (unsigned long)g_pipe_error_irq_count[2]);

  g_cam_health_last_ms = now_ms;
  g_cam_health_last_pipe1_frame = g_pipe1_frame_irq_count;
  g_cam_health_last_pipe2_frame = g_pipe2_frame_irq_count;
  g_cam_health_last_pipe1_vsync = g_pipe1_vsync_irq_count;
  g_cam_health_last_pipe_err[0] = g_pipe_error_irq_count[0];
  g_cam_health_last_pipe_err[1] = g_pipe_error_irq_count[1];
  g_cam_health_last_pipe_err[2] = g_pipe_error_irq_count[2];
}

static void app_flush_cam_irq_logs(void)
{
  if (g_pipe1_first_vsync_pending_log != 0)
  {
    g_pipe1_first_vsync_pending_log = 0;
    printf("[CAM] pipe1 first VSYNC IRQ\r\n");
  }

  if (g_pipe1_first_frame_pending_log != 0)
  {
    g_pipe1_first_frame_pending_log = 0;
    printf("[CAM] pipe1 first frame IRQ\r\n");
  }

  if (g_pipe2_first_frame_pending_log != 0)
  {
    g_pipe2_first_frame_pending_log = 0;
    printf("[CAM] pipe2 first frame IRQ\r\n");
  }

  if (g_pipe1_first_rearm_ok_pending_log != 0)
  {
    g_pipe1_first_rearm_ok_pending_log = 0;
    printf("[CAM] pipe1 rearm OK next_capt_idx=%d addr=0x%08lX\r\n",
           g_pipe1_first_rearm_ok_next_idx,
           (unsigned long)g_pipe1_first_rearm_ok_addr);
  }

  if (g_pipe1_rearm_fail_pending_log != 0)
  {
    g_pipe1_rearm_fail_pending_log = 0;
    printf("[CAM][ERR] pipe1 rearm failed ret=%d state=%lu disp_idx=%d capt_idx=%d next=%d\r\n",
           g_pipe1_rearm_fail_last_ret,
           (unsigned long)g_pipe1_rearm_fail_last_state,
           g_pipe1_rearm_fail_last_disp_idx,
           g_pipe1_rearm_fail_last_capt_idx,
           g_pipe1_rearm_fail_last_next_idx);
  }
}

void APP_CAM_DebugOnPipeError(uint32_t pipe)
{
  if (pipe < 3U)
  {
    g_pipe_error_irq_count[pipe]++;
  }
}

/* dma2d */
static SemaphoreHandle_t dma2d_lock;
static StaticSemaphore_t dma2d_lock_buffer;
static SemaphoreHandle_t dma2d_sem;
static StaticSemaphore_t dma2d_sem_buffer;
/* Store current DMA2D_HandleTypeDef instance so we can propagate to irq handler */
static DMA2D_HandleTypeDef *dma2d_current;

/* capture buffers */
static uint8_t capture_buffer[CAPTURE_BUFFER_NB][VENC_MAX_WIDTH * VENC_MAX_HEIGHT * CAPTURE_BPP] ALIGN_32 IN_PSRAM;
static int capture_buffer_disp_idx = 1;
static int capture_buffer_capt_idx = 0;

/* model */
static uint8_t network_ctx[STAI_NETWORK_CONTEXT_SIZE] ALIGN_32;
 /* nn input buffers */
static uint8_t nn_input_buffers[2][NN_WIDTH * NN_HEIGHT * NN_BPP] ALIGN_32 IN_PSRAM;
static bqueue_t nn_input_queue;
 /* nn output buffers */
static uint8_t nn_output_buffers[2][NN_BUFFER_OUT_SIZE_ALIGN] ALIGN_32;
static bqueue_t nn_output_queue;

/* venc */
static uint8_t venc_out_buffer[VENC_OUT_BUFFER_SIZE] ALIGN_32 UNCACHED;
static uint8_t uvc_in_buffers[VENC_OUT_BUFFER_SIZE] ALIGN_32;

/* uvc */
static struct uvcl_callbacks uvcl_cbs;
static int uvc_is_active;
static volatile int buffer_flying;
static int force_intra;

 /* threads */
#if !APP_DVP_BRINGUP_PIPE1_ONLY
static StaticTask_t nn_thread;
static StackType_t nn_thread_stack[2 * configMINIMAL_STACK_SIZE];
static StaticTask_t dp_thread;
static StackType_t dp_thread_stack[2 *configMINIMAL_STACK_SIZE];
#endif
static StaticTask_t isp_thread;
static StackType_t isp_thread_stack[2 *configMINIMAL_STACK_SIZE];
static SemaphoreHandle_t isp_sem;
static StaticSemaphore_t isp_sem_buffer;

static int is_cache_enable(void)
{
#if defined(USE_DCACHE)
  return 1;
#else
  return 0;
#endif
}

